// function name() {
//     console.log("nika")
//     console.log("Macharashvili")
// }
// ამ დავალებაში შვქმენით ფუნქცია Name რომელსაც მივანიჭეთ 2 მნიშვნელობად ჩვენი სახელი და გვარი და ბოლოს name() -ით გამოვიძახეთ

// name()
// // statement - განცხადება, კოდის ხაზი ერთი დავალება კომპიუტერისთვის

// javascript-ში კოდის ბლოკებს ვწერთ {}

// კოდის ბლოკი - რაც უნდა შესრულდეს კონკრეტულ განხადებაში

// custom - კონრეტულად ჩვენთან მორგეული

// ფუნქციას ვქმნით function keyword-ით, რომელსაც შემდეგ მოყვება ფუნქციის სახელი
// ფუნქციის კოდის ბლოკს ვწერთ {} ბრჩხილებში, ანუ იმას რაც უნდა შეასრულოს ფუნქციამ
// ინდენტაციას არანაირი მნიშვნელობა არ აქვს და მხოლოდ ვიყენებთ წაკითხვადობისთვის

// function greet() {
//     console.log("Hello world");
// }