# For Loops:

# 1. For Loop-ის მეშვეობით გამოიტანე 1-დან 10-მდე ციფრები.
# 2. For Loop-ის მეშვეობით დაბეჭდეთ სასურველი წინადადება რამდენჯერმე.
# While Loops: 

# 1. While Loop-ის მეშვეობით გამოიტანე ციფრები 1-დან 5-მდე.
# 2. While loop-ის მეშვეობით გამოიტანე Hello 3-ჯერ.
# Conditional Statements:

# Easy:
# 1. დაწერეთ პროგრამა, რომელიც ამოწმებს მომხმარებლის მიერ შეყვანილი ასაკი დადებითია თუ უარყოფითი.
# 2. დაწერეთ პროგრამა, რომელიც ამოწმებს მომხმარებლს მიერ შეყვანილი რიცხვი უდრის თუ არა 10-ს.

# Hard:
# 3. დაწერეთ, პროგრამა, რომელსაც იმ შემთხვევაში, თუ მომხარებლის მიერ შეყვანილი რიცხვი მეტია 0-ზე და ნაკლებია 10-ზე, გამოაქვს 'child'.

# Extreme:
# 4. მომხარებელს შეაყვანინეთ სამ ცვლადში სამკუთხედის სამი გვერდი, შემდეგ კი დააადგინეთ, ამ გვერდებისგან შესაძლებელია თუ არა სამკუხთედის აწყობა.
