// 1) შექმენით ობიექტი სადაც ჩაწერთ თვქენი საყვარელი პერსონაჟის მონაცემებს, დაამატეთ მინიმუმ 5 კუთვნილება თავიდანვე, შემდეგ დაბეჭდეთ ხუთივე კუთვნილება ცალ-ცალკე, 
// შემდეგ შეცვალეთ რომელიმე ორი კუთვნილება და დაბეჭდეთ თავიდან ბოლომდე ობიექტი, საბოლოოდ დაამატეთ ერთი კუთვნილება და წაშალეთ რომელიმე ძველი კუთვნილება, 
// კომენტარებით აუცილებლად ახზსენით თუ რას ნიშნავს ობიექტი, რაში გამოიყენება, რატომ არის მაგარი, რა არის კუთვნილება და რას ნიშნევას წერტილის ნოტაცია1)
const somewone = {
    name: "leon",
    surname: "black",
    sge: 67,
    mom: "lisa",
    dad: "ban"
}
console.log(name);
console.log(surname);
console.log(age);
console.log(mom);
console.log(dad);

somewone.dad = "alina";
somewone.age = "34";

delete somewone.name;


// კუთვნილება აღნიშნავს ობიექტის თვისებებს, ნებისმიერ რამეს რითიც შეგვიძლია დავახასიათოთ კონკრეტული ობიექტი
// წერტილის ნოტაცია საშუალებას გაწვდოს პირდაპირი ვიმოქმედოთ ობიექტის მონაცემებზე

